Autodesk.Revit.DB.AnnotationFamilyUtils.HasLeaderSnapReference(Autodesk.Revit.DB.Element)
Checks if the element supports the LEADER_SNAP_REFERENCE parameter.
Remarks:
Only some elements in annotation families have the LEADER_SNAP_REFERENCE parameter.
element:
The element to check.
Returns:
True if the element has the LEADER_SNAP_REFERENCE parameter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationFamilyUtils.HasExcludeFromLeaderOutline(Autodesk.Revit.DB.Element)
Checks if the element supports the EXCLUDE_FROM_LEADER_OUTLINE parameter.
Remarks:
Only some elements in annotation families have the EXCLUDE_FROM_LEADER_OUTLINE parameter.
element:
The element to check.
Returns:
True if the element has the EXCLUDE_FROM_LEADER_OUTLINE parameter, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationFamilyUtils.SetIsLeaderSnapReference(Autodesk.Revit.DB.Element,System.Boolean)
Sets if the element is a leader snap reference for annotation leader snapping.
Remarks:
This function controls the built-in parameter LEADER_SNAP_REFERENCE.
element:
The element to set.
isSnapReference:
Pass true to set the element as a leader snap reference, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
element doesn't support the LEADER_SNAP_REFERENCE parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationFamilyUtils.IsLeaderSnapReference(Autodesk.Revit.DB.Element)
Checks if the element is a leader snap reference for annotation leader snapping.
Remarks:
This function controls the built-in parameter LEADER_SNAP_REFERENCE.
element:
The element to check.
Returns:
True if the element is a leader snap reference, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
element doesn't support the LEADER_SNAP_REFERENCE parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationFamilyUtils.SetIsExcludedFromLeaderOutline(Autodesk.Revit.DB.Element,System.Boolean)
Sets if the element is excluded from the annotation outline used by leaders.
Remarks:
This function controls the built-in parameter EXCLUDE_FROM_LEADER_OUTLINE.
element:
The element to set.
isExcluded:
Pass true to exclude the element from the leader outline, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
element doesn't support the EXCLUDE_FROM_LEADER_OUTLINE parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationFamilyUtils.IsExcludedFromLeaderOutline(Autodesk.Revit.DB.Element)
Checks if the element is excluded from the annotation outline used by leaders.
Remarks:
This function controls the built-in parameter EXCLUDE_FROM_LEADER_OUTLINE.
element:
The element to check.
Returns:
True if the element is excluded from the leader outline, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
element doesn't support the EXCLUDE_FROM_LEADER_OUTLINE parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.AnnotationFamilyUtils
Utility functions for elements in annotation families.
Since:
2027